Revit 2027 API
BuiltInFailures.DimensionFailures.DimensionOverconstrained Property
 The Dimension would overconstrain the Sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DimensionOverconstrained { get; }
Public Shared ReadOnly Property DimensionOverconstrained As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DimensionOverconstrained {
	FailureDefinitionId^ get ();
}
static member DimensionOverconstrained : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace